{
  "logo": "My photos",
  "about": "About",
  "terms": "Terms of Use",
  "manual": "How to use",
  "back": "Back",
  "next": "Next",
  "continue": "Continue",
  "tryit": "Try it now!",
  "loading": "Please wait . . .",
  "ozivte_svoje": "Bring your",
  "nudne_staticke": "boring static",
  "fotografie": "photos to life too!",
  "mozete_to_bezplatne": "You can try it",
  "vyskusat_ihned": "for free right now.",
  "upload": "Upload a photo",
  "upload_video_btn": "Upload a video",
  "souhlas": "By uploading a photo, the user agrees to the application's terms, ",
  "souhlas_2": "which are outlined on the ",
  "podmienky_page": "Terms of Use page.",
  "terms_1": "1. The user agrees that all content uploaded to the server, including photos and videos, is their own content or they have the necessary rights to it.",
  "terms_2": "2. The user grants the server operator the necessary rights to use, display, share, and distribute the uploaded photos and videos in accordance with the terms of use.",
  "terms_3": "3. The user bears full responsibility for the content uploaded to the server, including photos and videos, and agrees that it does not infringe on copyright, personal rights, or any other third-party rights.",
  "terms_4": "4. The server operator is not responsible for the content uploaded by the user, including photos and videos, nor for any damages caused by using the server.",
  "terms_5": "5. The server operator reserves the right to remove inappropriate content uploaded by the user on the server or upon request from the affected person.",
  "terms_6": "6. The server operator reserves the right to modify these terms of use at any time.",
  "terms_7": "7. These terms of use are effective from the date of publication on the server and replace all previous versions.",
  "terms_date": "Update date of the terms: January 1, 2024",
  "nahrajte_foto": "Upload the required photo containing the face of at least one character",
  "error_not_face": "No face was found in the photo.",
  "error_try_another": "Try again with another photo or crop face manually.",
  "error_fileformat_photo": "Invalid file format. Please select a .jpg, .png, or .img file.",
  "error_fileformat_video": "Invalid file format. Please select a .mp4 file.",
  "error_clean": "Failed to clean a workspace. Server returned status code: ",
  "error_upload": "Failed to upload a file. Server returned status code: ",
  "error_get": "Failed to get data from server. Server returned status code: ",
  "select_file": "Please select a file",
  "upload_video": "Upload a video with facial movement of the required faces.",
  "connection_error": "Failed to connect to the BE server. Please try again later.",
  "download_button": "Video download",
  "done": "Your video has just been created :)",
  "custom_face": "Manual face cropping",
  "crop": "Crop selected area",
  "cropping": "Place the square on the desired face and press the \"Crop selected area\" button",
  "system_busy": "Please wait. The system is busy.",
  "queue_info": "The number of people ahead of you: ",
  "queue_waiting": "Maximum waiting time: ",
  "minutes": " minutes.",
  "VideoRecorder": "Webcam Recorder",
  "VideoRecorder-text": "On this page, you can record a video of your face movements from your webcam.",
  "stop": "Stop recording",
  "start": "Start recording",
  "download": "Download video",
  "about1": "This project was developed in 2023-2024 at the FIT VUT in Brno, as part of a bachelor's thesis titled \"Application for Reviving Photos\".",
  "about2": "The goal of the bachelor's thesis was to create a web application that allows users to animate their static photographs.",
  "about3": "Users can upload their own video with facial movements that they want to use to animate a selected part of a static photograph.",
  "about4": "The system automatically detects people, so the user only needs to upload a video with facial movements for the desired individuals, according to which the person in the photograph will be animated.",
  "about5": "Alternatively, the user can manually mark the faces of the desired people and then upload a video with facial movements.",
  "about6": "To upload a video with movement, one can use the Webcam component. This allows for recording video directly from the device's webcam.",
  "about7": "After uploading a photo, press the 'Webcam' button.",
  "about8": "Automatic face detection in the photograph was performed using the OpenCV library and Cascade Classifier.",
  "about9": "For animating faces, this application uses a component sourced from: https://github.com/sky24h/Face_Animation_Real_Time",
  "about10": "After animating each face, a final video is created. This is also facilitated by the OpenCV library.",
  "about11": "The application adds the animated cropped areas to the original photo, creating an animated group photograph.",
  "manual1": "1. On the welcome screen, press the 'Try it now!' button",
  "manual2": "2. Wait until the application starts (this step may not occur)",
  "manual3": "3. Once the application is ready, click the 'Upload Photo' button",
  "manual4": "4. Record videos with facial motion for the required faces",
  "manual4_1": "You will find a 'Choose File' and 'Upload a video' button for each person.",
  "manual4_2": "Use them to upload the requested video with facial motion for the person.",
  "manual4_3": "If you are missing a person, you can perform a manual face crop by clicking the 'Manual Face Crop' button.",
  "manual5": "5. Manual face crop (optional)",
  "manual5_1": "Position the square precisely on the face of the person you want to animate.",
  "manual5_2": "If necessary, adjust the size of the square.",
  "manual5_3": "Click the 'Crop selected area' button.",
  "manual5_4": "Continue by clicking 'Continue' or repeat the process with another person.",
  "manual5_5": "Your manually cropped faces will now be displayed among the face images.",
  "manual5_6": "Continue uploading motion videos for these faces as described in step 4.",
  "manual6": "After successfully uploading the video with facial motion of at least one person, the 'Continue' button will appear",
  "manual7": "6. Wait for the final video to be generated",
  "manual7_1": "The average wait time for the motion of one face in the image is approximately 30 seconds.",
  "manual8": "7. The generated video will play automatically",
  "manual8_1": "You can enlarge the video or download it to your device using the 'Save video' button.",
  "manual1_img": "/images/manual/english/1.png",
  "manual2_img": "/images/manual/english/2.png",
  "manual3_img": "/images/manual/english/3.png",
  "manual4_img": "/images/manual/english/4.png",
  "manual5_img": "/images/manual/english/5.png",
  "manual6_img": "/images/manual/english/6.png",
  "manual7_img": "/images/manual/english/7.png",
  "manual8_img": "/images/manual/english/8.png",
  "iPadNotSupported": "To use the webcam on iPad devices, please navigate back to the previous page and click on the \"Select Fle\" button near the desired face and then on \"Take Video\"."
}
