{
  "logo": "Moje fotografie",
  "about": "O projekte",
  "terms": "Podmienky použitia",
  "manual": "Návod",
  "back": "Naspäť",
  "next": "Pokračovať",
  "continue": "Pokračovať",
  "tryit": "Vyskúšať teraz",
  "loading": "Prosím čakajte . . .",
  "ozivte_svoje": "Oživte svoje",
  "nudne_staticke": "nudné statické",
  "fotografie": "fotografie aj Vy!",
  "mozete_to_bezplatne": "Môžete to bezplatne",
  "vyskusat_ihned": "vyskášať ihneď",
  "upload": "Nahrať fotku",
  "upload_video_btn": "Nahrať video",
  "souhlas": "Užívateľ nahraním fotografie súhlasí s podmienkami aplikácie, ",
  "souhlas_2": "ktoré sú uvedené na karte  ",
  "podmienky_page": "Podmienky použitia.",
  "terms_1": "1. Užívateľ súhlasí, že všetok obsah, ktorý nahráva na server, vrátane fotografií a videí, je jeho vlastným obsahom alebo má k nemu príslušné oprávnenie.",
  "terms_2": "2. Užívateľ udeľuje prevádzkovateľovi servera nevyhnutné práva k používaniu, zobrazovaniu, zdieľaniu a distribúcii nahraných fotografií a videí v súlade s podmienkami použitia.",
  "terms_3": "3. Užívateľ nesie plnú zodpovednosť za obsah nahrávaný na server, vrátane fotografií a videí, a súhlasí s tým, že neporušuje autorské práva, osobné práva ani žiadne ďalšie práva tretích strán.",
  "terms_4": "4. Prevádzkovateľ servera nezodpovedá za obsah nahrávaný užívateľom, vrátane fotografií a videí, ani za škody spôsobené používaním servera.",
  "terms_5": "5. Prevádzkovateľ servera si vyhradzuje právo odstrániť nevhodný obsah nahrávaný užívateľom na serveri alebo na požiadanie dotknutej osoby.",
  "terms_6": "6. Prevádzkovateľ servera si vyhradzuje právo kedykoľvek upraviť tieto podmienky použitia.",
  "terms_7": "7. Tieto podmienky použitia sú platné od dátumu zverejnenia na serveri a nahradzujú všetky predchádzajúce verzie.",
  "terms_date": "Dátum aktualizácie podmienok: 1. 1. 2024",
  "nahrajte_foto": "Nahrajte požadovanú fotografiu obsahujúcu tvár aspoň jednej postavy",
  "error_not_face": "Na fotke nebola nájdená žiadna tvár.",
  "error_try_another": "Vyskúšajte prosím použiť inú fotografiu alebo orežte tvár manuálne.",
  "error_fileformat_photo": "Zlý formát súboru. Zvoľte .jpg, .png, alebo .img súbor.",
  "error_fileformat_video": "Zlý formát súboru. Zvoľte .mp4 súbor.",
  "error_clean": "Chyba skriptu clean. Návratový kód chyby: ",
  "error_upload": "Nepodarilo sa nahrať požadovaný súbor. Návratový kód chyby: ",
  "error_get": "Nepodarilo sa načítať potrebné súbory. Návratový kód chyby: ",
  "select_file": "Prosím vyberte súbor",
  "upload_video": "Nahrajte požadovaným tváram video s pohybom tváre, prípadne stlačte tlačidlo pre manuálny orez tváre.",
  "connection_error": "Nepodarilo sa nadviazať komunikáciu s BE serverom. Prosím skúste znova neskôr.",
  "download_button": "Uložiť video",
  "done": "Vaše video bolo práve vytvorené :)",
  "custom_face": "Manuálny orez tváre",
  "crop": "Orezať vybranú oblasť",
  "cropping": "Umiestnite štvorec na požadovanú tvár a stlačte tlačidlo \"Orezať vybranú oblasť\"",
  "system_busy": "Prosím čakajte. Systém je zaneprázdnený.",
  "queue_info": "Počet ľudí pred vami: ",
  "queue_waiting": "Maximálna doba čakania: ",
  "minutes": " minút.",
  "VideoRecorder": "Webkamera",
  "VideoRecorder-text": "Na tejto stránke si môžete nahrať video pohybu tváre z vašej webkamery.",
  "stop": "Zastaviť nahrávanie",
  "start": "Spustiť nahrávanie",
  "download": "Stiahnuť video",
  "about1": "Tento projekt vznikol v rokoch 2023-2024 na FIT VUT v Brne ako súčasť bakalárskej práce pod názvom \"Aplikace pro oživení fotek\".",
  "about2": "Cieľom bakalárskej práce bolo vytvoriť webovú aplikáciu, ktorá umožní používateľom oživiť ich statické fotografie.",
  "about3": "Používatelia môžu nahrať vlastné video s pohybom tváre, ktoré chcú použiť na oživenie vybranej časti statickej fotografie.",
  "about4": "Systém detekuje osoby automaticky, takže používateľovi stačí k požadovaným osobám nahrať video s pohybom tváre, podľa ktorého oživí danú osobu na fotografii.",
  "about5": "Prípadne môže používateľ využiť manuálne označenie tváre požadovaných osôb a následné nahranie videa s pohybom tváre.",
  "about6": "K nahratiu videa s pohybom môže použiť komponentu Webkamera. Ta mu umožní nahranie videa priamo z webkamery jeho zariadenia.",
  "about7": "Po nahrati fotografie stlačí kliknúť na tlačidlo \"Webkamera\".",
  "about8": "K automatickej detekcii tvárí na fotografii bola využitá knihovňa OpenCV a Cascade Classifier.",
  "about9": "Na rozpohybovanie tvárí používa táto aplikácia komponentu prevzatú z: https://github.com/sky24h/Face_Animation_Real_Time",
  "about10": "Po rozpohybovani každej tváre dôjde k vytvoreniu výsledného videa. To zabezpečuje taktiež knihovňa OpenCV.",
  "about11": "Aplikácia dopĺňa do pôvodnej fotografie orezané rozpohybované oblasti, čím vznikne rozpohybovaná skupinová fotografia.",
  "manual1": "1. Na úvodnej obrazovke stlačte tlačidlo \"Vyskúšať teraz\"",
  "manual2": "2. Počkajte, kým sa aplikácia nespustí (tento krok nemusí nastať)",
  "manual3": "3. Keď je aplikácia pripravená, kliknite na tlačidlo \"Nahrať fotku\"",
  "manual4": "4. Nahrávajte videá s pohybom tváre požadovaným osobám",
  "manual4_1": "U každej osoby nájdete tlačidlo \"Vybrať súbor\" a \"Nahrať video\".",
  "manual4_2": "S ich pomocou nahrajte požadované video s pohybom tváre danej osobe.",
  "manual4_3": "Ak vám chýba nejaká osoba, môžete vykonať manuálny orez tváre kliknutím na tlačidlo \"Manuálny orez tváre\".",
  "manual5": "5. Manuálny orez tváre (voliteľné)",
  "manual5_1": "Umiestnite štvorec presne na tvár osoby, ktorú chcete rozpohybovať.",
  "manual5_2": "Ak je to potrebné, prispôsobte veľkosť štvorca.",
  "manual5_3": "Kliknite na tlačidlo \"Orezať vybranú oblasť\".",
  "manual5_4": "Pokračujte kliknutím na \"Pokračovať\" alebo proces zopakujte s inou osobou.",
  "manual5_5": "Vaše manuálne orezané tváre sa teraz zobrazia medzi obrázkami tvárí.",
  "manual5_6": "Pokračujte nahrávaním videí s pohybom pre tieto tváre podľa kroku č. 4.",
  "manual6": "Po úspešnom nahratí videa s pohybom tváre aspoň jednej osoby sa zobrazí tlačidlo \"Pokračovať\"",
  "manual7": "6. Počkajte na vygenerovanie finálneho videa",
  "manual7_1": "Priemerná čakacia doba pre pohyb jednej tváre v obraze je približne 30 sekúnd.",
  "manual8": "7. Vygenerované video sa automaticky prehrá",
  "manual8_1": "Môžete si video zväčšiť alebo ho stiahnuť do svojho zariadenia pomocou tlačidla \"Uložiť video\".",
  "manual1_img": "/images/manual/slovak/1.png",
  "manual2_img": "/images/manual/slovak/2.png",
  "manual3_img": "/images/manual/slovak/3.png",
  "manual4_img": "/images/manual/slovak/4.png",
  "manual5_img": "/images/manual/slovak/5.png",
  "manual6_img": "/images/manual/slovak/6.png",
  "manual7_img": "/images/manual/slovak/7.png",
  "manual8_img": "/images/manual/slovak/8.png",
  "iPadNotSupported": "Pre použitie webkamery na iPad zariadení prejdite na stránku späť a kliknite pri požadovanej tvári na tlačidlo \"Vybrať súbor\" a potom na \"Nahrať video\"."
}